{
    "architectures": [
        "ThinkTalkLLaDA2ForCausalLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_think_talk_llada2.ThinkTalkLLaDA2Config",
        "AutoModelForCausalLM": "modeling_think_talk_llada2.ThinkTalkLLaDA2ForCausalLM"
    },
    "model_type": "think_talk_llada2_veomni",

    "_doc": "v6c: hybrid_xattn anchor injection + 4-layer talk + FROZEN lm_head. Talk sequence is L (noisy only). Layer 0 receives anchor via gated residual (v2-style, fixed gate 0.2); EVERY talk layer also runs a cross-attention block from its noisy Q stream to the full think anchor [B, 2L, H] as K/V. The clean half reaches talk only through cross-attn with a block-causal mask. v6c freezes lm_head at LLaDA's tied word_embeddings to prevent the lm_head-drift failure mode observed in v6b (cosine sim to LLaDA dropped to 0.01 by step 15000, talk hidden states never learned to be LLaDA-compatible). Pairs with t3_llada2_mini_bd_oput_1gpu.yaml's noise_range=(0.25, 1.0) ramp and rollout_ratio_low/high ramp.",

    "num_hidden_layers": 20,
    "hidden_size": 2048,
    "intermediate_size": 5120,
    "first_k_dense_replace": 1,
    "hidden_act": "silu",
    "max_position_embeddings": 16384,
    "moe_intermediate_size": 512,
    "norm_topk_prob": true,
    "num_experts_per_tok": 8,
    "norm_head": false,
    "num_attention_heads": 16,
    "num_experts": 256,
    "num_key_value_heads": 4,
    "rope_theta": 600000,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.52.3",
    "use_bias": false,
    "use_rmsnorm": true,
    "rms_norm_eps": 1e-06,
    "head_dim": 128,
    "num_shared_experts": 1,
    "use_cache": false,
    "use_qkv_bias": false,
    "embedding_dropout": 0.0,
    "norm_softmax": false,
    "output_dropout": 0.0,
    "vocab_size": 157184,
    "rotary_dim": 64,
    "using_split_qkv_in_self_attention": false,
    "router_dtype": "fp32",
    "moe_router_enable_expert_bias": true,
    "routed_scaling_factor": 2.5,
    "n_group": 8,
    "topk_group": 4,
    "score_function": "sigmoid",
    "initializer_range": 0.02,
    "max_window_layers": 28,
    "output_router_logits": false,
    "pad_token_id": 156892,
    "partial_rotary_factor": 0.5,
    "use_sliding_window": false,
    "attention_dropout": 0.0,

    "talk_num_layers": 4,
    "talk_hidden_size": -1,
    "talk_num_attention_heads": -1,
    "talk_num_key_value_heads": -1,
    "talk_intermediate_size": -1,

    "anchor_fuser_type": "last_only",
    "anchor_layers": "last",
    "anchor_conditioning": "gated_residual",
    "anchor_injection_mode": "hybrid_xattn",
    "anchor_inject_layers": "first",
    "anchor_gate_learnable": false,
    "anchor_gate_init": -2.0,
    "anchor_gate_value": 0.2,

    "prune_think_last_n_layer": 0,
    "train_think": false,
    "train_talk": true,
    "train_lm_head": false
}
